<template>
    <div class="login-container">
        <el-dialog
            v-model="userStore.loginVisible"
            title="登录"
        >
            <div class="content">
                <el-row>
                    <el-col :span="12">
                        <div class="login">
                            <div v-show="scene === 0">
                                <el-form :model="form">
                                    <el-form-item>
                                        <el-input :prefix-icon="User" v-model="form.phone" placeholder="请输入手机号码" />
                                    </el-form-item>
                                    <el-form-item>
                                        <el-input :prefix-icon="Lock" v-model="form.code" placeholder="请输入手机验证码" />
                                    </el-form-item>
                                    <el-button :disabled="!isPhone" @click="getCode">获取验证码</el-button>
                                </el-form>
                                <el-button type="primary" style="width:100%">用户登录</el-button>
                                <div class="bottom" @click="changeScene">
                                    <p>微信扫码登录</p>
                                    <svg t="1725084086532" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9567" width="32" height="32"><path d="M669.3 369.4c9.8 0 19.6 0 29.4 1.6C671 245.2 536.9 152 383.2 152 211.6 152 71 269.7 71 416.8c0 85 45.8 156.9 124.2 210.9l-31.1 93.2L273.6 667c39.2 8.2 70.3 16.3 109.5 16.3 9.8 0 19.6 0 31.1-1.6-6.5-21.3-9.8-42.5-9.8-65.4 0.1-135.7 116.2-246.9 264.9-246.9z m-168.4-85c24.5 0 39.2 16.3 39.2 39.2 0 22.9-16.3 39.2-39.2 39.2-24.5 0-47.4-16.4-47.4-39.2 0-24.5 24.6-39.2 47.4-39.2z m-216.3 73.1c-24.7 0-47.8-16.2-47.8-38.8 0-24.3 24.7-38.8 47.8-38.8s39.5 16.2 39.5 38.8c0.1 22.7-16.4 38.8-39.5 38.8z" fill="#24DB5A" p-id="9568"></path><path d="M953.8 613c0-125.9-124.2-227.2-264.8-227.2-148.8 0-266.5 103-266.5 227.2 0 125.9 117.7 227.2 266.5 227.2 31.1 0 62.1-8.2 93.2-16.3l85 47.4-22.9-78.5c62.1-47.4 109.5-109.5 109.5-179.8z m-351.5-39.2c-14.7 0-31.1-14.7-31.1-31.1 0-14.7 16.3-31.1 31.1-31.1 22.9 0 39.2 16.3 39.2 31.1 0 16.4-14.7 31.1-39.2 31.1z m178-7.6c-14.8 0-31.3-14.6-31.3-30.7 0-14.6 16.5-30.7 31.3-30.7 23.1 0 39.5 16.2 39.5 30.7 0 16.2-16.4 30.7-39.5 30.7z" fill="#24DB5A" p-id="9569"></path></svg>
                                    
                                </div>
                            </div>
                            <div v-show="scene === 1">
                                微信扫码登录结构
                            </div>
                        </div>
                    </el-col>
                    <el-col :span="12">
                        <div class="right">
                            <div class="top">
                                <div class="item">
                                    <img src="../../assets/guigu_code.png" />
                                    <svg t="1725084739042" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9730" width="16" height="16"><path d="M664.250054 368.541681c10.015098 0 19.892049 0.732687 29.67281 1.795902-26.647917-122.810047-159.358451-214.077703-310.826188-214.077703-169.353083 0-308.085774 114.232694-308.085774 259.274068 0 83.708494 46.165436 152.460344 123.281791 205.78483l-30.80868 91.730191 107.688651-53.455469c38.558178 7.53665 69.459978 15.308661 107.924012 15.308661 9.66308 0 19.230993-0.470721 28.752858-1.225921-6.025227-20.36584-9.521864-41.723264-9.521864-63.862493C402.328693 476.632491 517.908058 368.541681 664.250054 368.541681zM498.62897 285.87389c23.200398 0 38.557154 15.120372 38.557154 38.061874 0 22.846334-15.356756 38.156018-38.557154 38.156018-23.107277 0-46.260603-15.309684-46.260603-38.156018C452.368366 300.994262 475.522716 285.87389 498.62897 285.87389zM283.016307 362.090758c-23.107277 0-46.402843-15.309684-46.402843-38.156018 0-22.941502 23.295566-38.061874 46.402843-38.061874 23.081695 0 38.46301 15.120372 38.46301 38.061874C321.479317 346.782098 306.098002 362.090758 283.016307 362.090758zM945.448458 606.151333c0-121.888048-123.258255-221.236753-261.683954-221.236753-146.57838 0-262.015505 99.348706-262.015505 221.236753 0 122.06508 115.437126 221.200938 262.015505 221.200938 30.66644 0 61.617359-7.609305 92.423993-15.262612l84.513836 45.786813-23.178909-76.17082C899.379213 735.776599 945.448458 674.90216 945.448458 606.151333zM598.803483 567.994292c-15.332197 0-30.807656-15.096836-30.807656-30.501688 0-15.190981 15.47546-30.477129 30.807656-30.477129 23.295566 0 38.558178 15.286148 38.558178 30.477129C637.361661 552.897456 622.099049 567.994292 598.803483 567.994292zM768.25071 567.994292c-15.213493 0-30.594809-15.096836-30.594809-30.501688 0-15.190981 15.381315-30.477129 30.594809-30.477129 23.107277 0 38.558178 15.286148 38.558178 30.477129C806.808888 552.897456 791.357987 567.994292 768.25071 567.994292z" fill="#2c2c2c" p-id="9731"></path></svg>
                                    <p>微信扫一扫关注</p>
                                    <p>快速预约挂号</p>
                                </div>
                                <div class="item">
                                    <img src="../../assets/phone_code.png" />
                                    <svg t="1725084789413" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10928" width="16" height="16"><path d="M736.653061 929.959184H287.346939c-45.97551 0-83.591837-37.616327-83.591837-83.591837V177.632653c0-45.97551 37.616327-83.591837 83.591837-83.591837h449.306122c45.97551 0 83.591837 37.616327 83.591837 83.591837v668.734694c0 45.97551-37.616327 83.591837-83.591837 83.591837zM287.346939 135.836735c-22.987755 0-41.795918 18.808163-41.795919 41.795918v668.734694c0 22.987755 18.808163 41.795918 41.795919 41.795918h449.306122c22.987755 0 41.795918-18.808163 41.795919-41.795918V177.632653c0-22.987755-18.808163-41.795918-41.795919-41.795918H287.346939z" fill="#333333" p-id="10929"></path><path d="M616.489796 815.020408H407.510204c-11.493878 0-20.897959-9.404082-20.897959-20.897959s9.404082-20.897959 20.897959-20.897959h208.979592c11.493878 0 20.897959 9.404082 20.897959 20.897959s-9.404082 20.897959-20.897959 20.897959z" fill="#333333" p-id="10930"></path></svg>
                                    <p>扫一扫下载</p>
                                    <p>预约挂号 APP</p>
                                </div>
                            </div>
                            <p class="tip">尚医通官方指定平台</p>
                            <p class="tip">快速挂号 安全放心</p>
                        </div>
                    </el-col>
                </el-row>
            </div>
            <template #footer>
                <el-button>关闭窗口</el-button>
            </template>
        </el-dialog>
    </div>
</template>

<script setup lang="ts">
  import useUserStore from '@/store/modules/user';
  import { reactive, ref, computed } from 'vue'
  import { User, Lock } from '@element-plus/icons-vue'

  let userStore = useUserStore();
  let form = reactive({
    phone: '',
    code: ''
  })
  let scene = ref<number>(0);

let isPhone = computed(() => {
    let reg = /^[1][3-9][0-9]{9}$/;
    return reg.test(form.phone)
})

const changeScene = () => {
    scene.value = 1;
}


const getCode = async() => {
    try{
        await userStore.getCode(form.phone);
        form.code = userStore.userCode;
    } catch(error) {
        console.log(error);
        
    }
    
}

</script>
<script lang="ts">
export default {
    name: 'Login'
}
</script>

<style scoped lang="scss">
.login-container {
    ::v-deep(.el-dialog__body) {
        border-top: 1px solid #eee;
        border-bottom: 1px solid #eee;
    }
    .login {
        padding: 20px;
        border: 1px solid #eee;
    }
    .bottom {
        display: flex;
        flex-direction: column;
        align-items: center;
        margin-top:10px;
        p {
            margin: 10px 0;
        }
    }
    .right {
        .top {
            display: flex;
            justify-content: space-around;
            
            .item {
                display: flex;
                flex-direction: column;
                align-items: center;
                img {
                    width: 130px;
                    height: 130px;
                }
                p {
                    margin: 5px 0;
                }
            }
        }
        .tip {
            text-align: center;
            font-size: 20px;
            margin: 20px 0;
            font-weight: 900;
        }
    }
}
</style>